ch-f/optee_os_stfork/core/arch/arm/plat-stm32mp1/main.c
#define SYSRAM_END			(SYSRAM_BASE + SYSRAM_SIZE)
#define SYSRAM_SEC_END			(SYSRAM_BASE + SYSRAM_SEC_SIZE)
#define SRAMS_END			(SRAM4_BASE + SRAM4_SIZE)
#define SRAMS_START			SRAM1_BASE
#define TZSRAM_END			(CFG_TZSRAM_START + CFG_TZSRAM_SIZE)

#define SCMI_SHM_IS_IN_SRAMX	((CFG_STM32MP1_SCMI_SHM_BASE >= SRAM1_BASE) && \
				 (CFG_STM32MP1_SCMI_SHM_BASE + \
				  CFG_STM32MP1_SCMI_SHM_SIZE) <= SRAMS_END)

#define TZSRAM_FITS_IN_SYSRAM_SEC	((CFG_TZSRAM_START >= SYSRAM_BASE) && \
					 (TZSRAM_END <= SYSRAM_SEC_END))

#define TZSRAM_FITS_IN_SYSRAM_AND_SRAMS	((CFG_TZSRAM_START >= SYSRAM_BASE) && \
					 (CFG_TZSRAM_START < SYSRAM_END) && \
					 (TZSRAM_END > SYSRAM_END) && \
					 (TZSRAM_END <= SRAMS_END) && \
					 (SYSRAM_SIZE == SYSRAM_SEC_SIZE))

#define TZSRAM_FITS_IN_SRAMS	((CFG_TZSRAM_START >= SRAMS_START) && \
				 (CFG_TZSRAM_START < SRAMS_END) && \
				 (TZSRAM_END <= SRAMS_END))

#define TZSRAM_IS_IN_DRAM	(CFG_TZSRAM_START >= CFG_DRAM_BASE)

#ifdef CFG_WITH_PAGER
/*
 * At build time, we enforce that, when pager is used,
 * either TZSRAM fully fits inside SYSRAM secure address range,
 * or TZSRAM fully fits inside the full SYSRAM and spread inside SRAMx orderly,
 * or TZSRAM fully fits some inside SRAMs address range,
 * or TZSRAM is in DDR for debug and test purpose.
 */
#if (TZSRAM_FITS_IN_SYSRAM_SEC || \
    TZSRAM_FITS_IN_SYSRAM_AND_SRAMS || \
    TZSRAM_FITS_IN_SRAMS || \
    TZSRAM_IS_IN_DRAM)
    #pragma message "TZSRAM constrains OK"
#else
    #error "TZSRAM constrains fail"
#endif
#endif

#if TZSRAM_FITS_IN_SYSRAM_AND_SRAMS || TZSRAM_FITS_IN_SRAMS || \
	SCMI_SHM_IS_IN_SRAMX
/* At run time we enforce that SRAM1 to SRAM4 are properly assigned if used */
static TEE_Result init_stm32mp15_secure_srams(void)
{
	if (IS_ENABLED(CFG_WITH_PAGER)) {
		if (core_is_buffer_intersect(CFG_TZSRAM_START, CFG_TZSRAM_SIZE,
					     SRAM1_BASE, SRAM1_SIZE))
			stm32mp_register_secure_periph_iomem(SRAM1_BASE);

		if (core_is_buffer_intersect(CFG_TZSRAM_START, CFG_TZSRAM_SIZE,
					     SRAM2_BASE, SRAM2_SIZE))
			stm32mp_register_secure_periph_iomem(SRAM2_BASE);

		if (core_is_buffer_intersect(CFG_TZSRAM_START, CFG_TZSRAM_SIZE,
					     SRAM3_BASE, SRAM3_SIZE))
			stm32mp_register_secure_periph_iomem(SRAM3_BASE);

		if (core_is_buffer_intersect(CFG_TZSRAM_START, CFG_TZSRAM_SIZE,
					     SRAM4_BASE, SRAM4_SIZE))
			stm32mp_register_secure_periph_iomem(SRAM4_BASE);
	}

	if (SCMI_SHM_IS_IN_SRAMX) {
		if (core_is_buffer_intersect(CFG_STM32MP1_SCMI_SHM_BASE,
					     CFG_STM32MP1_SCMI_SHM_SIZE,
					     SRAM1_BASE, SRAM1_SIZE))
			stm32mp_register_non_secure_periph_iomem(SRAM1_BASE);

		if (core_is_buffer_intersect(CFG_STM32MP1_SCMI_SHM_BASE,
					     CFG_STM32MP1_SCMI_SHM_SIZE,
					     SRAM2_BASE, SRAM2_SIZE))
			stm32mp_register_non_secure_periph_iomem(SRAM2_BASE);

		if (core_is_buffer_intersect(CFG_STM32MP1_SCMI_SHM_BASE,
					     CFG_STM32MP1_SCMI_SHM_SIZE,
					     SRAM3_BASE, SRAM3_SIZE))
			stm32mp_register_non_secure_periph_iomem(SRAM3_BASE);

		if (core_is_buffer_intersect(CFG_STM32MP1_SCMI_SHM_BASE,
					     CFG_STM32MP1_SCMI_SHM_SIZE,
					     SRAM4_BASE, SRAM4_SIZE))
			stm32mp_register_non_secure_periph_iomem(SRAM4_BASE);
	}

	return TEE_SUCCESS;
}

service_init_late(init_stm32mp15_secure_srams);
#endif /* TZSRAM_FITS_IN_SYSRAM_AND_SRAMS || TZSRAM_FITS_IN_SRAMS */
#endif /* CFG_STM32MP15 && CFG_TZSRAM_START */

static uintptr_t stm32_dbgmcu_base(void)
{
	static void *va;

	if (!cpu_mmu_enabled())
		return DBGMCU_BASE;

	if (!va)
		va = phys_to_virt(DBGMCU_BASE, MEM_AREA_IO_SEC, 1);

	return (uintptr_t)va;
}

/* SoC versioning util, returns default ID if can't access DBGMCU */
TEE_Result stm32mp1_dbgmcu_get_chip_version(uint32_t *chip_version)
{
	uint32_t id = STM32MP1_CHIP_DEFAULT_VERSION;

	if (!chip_version)
		return TEE_ERROR_BAD_PARAMETERS;

	if (stm32_bsec_read_debug_conf() & BSEC_DBGSWGEN)
		id = (io_read32(stm32_dbgmcu_base() + DBGMCU_IDC) &
		      DBGMCU_IDC_REV_ID_MASK) >> DBGMCU_IDC_REV_ID_SHIFT;

	*chip_version = id;

	return TEE_SUCCESS;
}

/* SoC device ID util, returns default ID if can't access DBGMCU */
TEE_Result stm32mp1_dbgmcu_get_chip_dev_id(uint32_t *chip_dev_id)
{
	uint32_t id = STM32MP1_CHIP_ID;

	if (!chip_dev_id)
		return TEE_ERROR_BAD_PARAMETERS;

	if (stm32_bsec_read_debug_conf() & BSEC_DBGSWGEN)
		id = io_read32(stm32_dbgmcu_base() + DBGMCU_IDC) &
		     DBGMCU_IDC_DEV_ID_MASK;

	*chip_dev_id = id;

	return TEE_SUCCESS;
}

/*
 * GIC init, used also for primary/secondary boot core wake completion
 */
static struct gic_data gic_data;

void itr_core_handler(void)
{
	gic_it_handle(&gic_data);
}

void main_init_gic(void)
{
	assert(cpu_mmu_enabled());

	gic_init(&gic_data, get_gicc_base(), get_gicd_base());
	itr_init(&gic_data.chip);

	stm32mp_register_online_cpu();
}

void main_secondary_init_gic(void)
{
	gic_cpu_init(&gic_data);

	stm32mp_register_online_cpu();
}

static TEE_Result init_stm32mp1_drivers(void)
{
	TEE_Result res = TEE_ERROR_GENERIC;
	const struct stm32_firewall_cfg sec_cfg[] = {
		{ FWLL_SEC_RW | FWLL_MASTER(0) },
		{ }, /* Null terminated */
	};

	/* Without secure DTB support, some drivers must be inited */
	if (!IS_ENABLED(CFG_EMBED_DTB))
		stm32_etzpc_init(ETZPC_BASE);

	res = stm32_firewall_set_config(SYSRAM_BASE, SYSRAM_SEC_SIZE, sec_cfg);
	if (res)
		panic("Unable to secure SYSRAM");

	return TEE_SUCCESS;
}
driver_init_late(init_stm32mp1_drivers);

vaddr_t get_gicc_base(void)
{
	struct io_pa_va base = { .pa = GIC_BASE + GICC_OFFSET };

	return io_pa_or_va_secure(&base, 1);
}

vaddr_t get_gicd_base(void)
{
	struct io_pa_va base = { .pa = GIC_BASE + GICD_OFFSET };

	return io_pa_or_va_secure(&base, 1);
}

void stm32mp_get_bsec_static_cfg(struct stm32_bsec_static_cfg *cfg)
{
	cfg->base = BSEC_BASE;
	cfg->upper_start = STM32MP1_UPPER_OTP_START;
	cfg->max_id = STM32MP1_OTP_MAX_ID;
}

bool __weak stm32mp_with_pmic(void)
{
	return false;
}

uint32_t may_spin_lock(unsigned int *lock)
{
	if (!lock || !cpu_mmu_enabled())
		return 0;

	return cpu_spin_lock_xsave(lock);
}

