ch-f/optee_os_stfork/core/arch/arm/plat-stm32mp1/main.c
	MSG("Internal tamper %u (%s) occurs", id - INT_TAMP1 + 1, tamp_name);

	return TAMP_CB_ACK_AND_RESET;
}
DECLARE_KEEP_PAGER(stm32mp1_itamper_action);

static uint32_t __unused stm32mp1_etamper_action(int id __maybe_unused)
{
	MSG("External tamper %u occurs", id - EXT_TAMP1 + 1);

	return TAMP_CB_ACK_AND_RESET;
}
DECLARE_KEEP_PAGER(stm32mp1_etamper_action);

static TEE_Result stm32_configure_tamp(void)
{
	TEE_Result res __maybe_unused = TEE_SUCCESS;
	struct stm32_bkpregs_conf bkpregs_conf = {
		.nb_zone1_regs = 10, /* 10 registers in zone 1 */
		.nb_zone2_regs = 5   /* 5 registers in zone 2 */
				     /* Zone3 all remaining */
	};

	/* Enable BKP Register protection */
	if (stm32_tamp_set_secure_bkpregs(&bkpregs_conf))
		panic();

	/*
	 * The stm32_tamp_activate_tamp() for INT_TAMPx returns an error code
	 * only if INT_TAMPx doesn't exist on the SoC or if 'mode' is
	 * incompatible. Here 'mode' is the simplest one, and we only activate
	 * existing INT_TAMPx.
	 */
	stm32_tamp_activate_tamp(INT_TAMP1, TAMP_ERASE,
				 stm32mp1_itamper_action);
	stm32_tamp_activate_tamp(INT_TAMP2, TAMP_ERASE,
				 stm32mp1_itamper_action);
	stm32_tamp_activate_tamp(INT_TAMP3, TAMP_ERASE,
				 stm32mp1_itamper_action);
	stm32_tamp_activate_tamp(INT_TAMP4, TAMP_ERASE,
				 stm32mp1_itamper_action);
#ifdef CFG_STM32MP13
	stm32_tamp_activate_tamp(INT_TAMP7, TAMP_ERASE,
				 stm32mp1_itamper_action);
	stm32_tamp_activate_tamp(INT_TAMP12, TAMP_ERASE,
				 stm32mp1_itamper_action);
	stm32_tamp_activate_tamp(INT_TAMP13, TAMP_ERASE,
				 stm32mp1_itamper_action);
#endif

#ifdef CFG_STM32MP13
	/*
	 * EXT_TAMPx needs to exist but also to be activated in DT. Here, we
	 * check if the EXT_TAMP2 is defined in DT.
	 */
	res = stm32_tamp_activate_tamp(EXT_TAMP2, TAMP_ERASE,
				       stm32mp1_etamper_action);
	if (res == TEE_ERROR_BAD_PARAMETERS)
		DMSG("no EXT_TAMP2 on this platform");
	else if (res == TEE_ERROR_ITEM_NOT_FOUND)
		DMSG("EXT_TAMP2 in pin was not found in device tree");
#endif

	if (stm32_tamp_set_config())
		panic();

	/* Enable timestamp for tamper */
	stm32_rtc_set_tamper_timestamp();

	return TEE_SUCCESS;
}

driver_init_late(stm32_configure_tamp);
#endif

#ifdef CFG_STM32_HSE_MONITORING
/* pourcent rate of hse alarm */
#define HSE_ALARM_PERCENT	110
#define FREQ_MONITOR_COMPAT	"st,freq-monitor"

static void stm32_hse_over_frequency(uint32_t ticks __unused,
				     void *user_data __unused)
{
	EMSG("HSE over frequency: nb ticks:%"PRIu32, ticks);
}
DECLARE_KEEP_PAGER(stm32_hse_over_frequency);

static TEE_Result stm32_hse_monitoring(void)
{
	struct clk *hse_clk = stm32mp_rcc_clock_id_to_clk(CK_HSE);
	struct clk *hsi_clk = stm32mp_rcc_clock_id_to_clk(CK_HSI);
	unsigned long hse = 0;
	unsigned long hsi_cal = 0;
	struct counter_device *counter;
	uint32_t ticks = 0;
	void *fdt = NULL;
	void *config = NULL;
	int node = 0;

	DMSG("HSE monitoring");

	fdt = get_embedded_dt();
	node = fdt_node_offset_by_compatible(fdt, 0, FREQ_MONITOR_COMPAT);
	if (node < 0)
		panic();

	if (_fdt_get_status(fdt, node) == DT_STATUS_DISABLED)
		return TEE_SUCCESS;

	hse = clk_get_rate(hse_clk);
	hsi_cal = clk_get_rate(hsi_clk);
	/*
	 * hsi_cal is based on hsi & DIVISOR
	 * DIVISOR is fixed, (stm32mp13:1024)
	 */
	hsi_cal /= 1024;

	ticks = (hse / 100) * HSE_ALARM_PERCENT;
	ticks /= hsi_cal;

	DMSG("HSE:%luHz HSI cal:%luHz alarm:%"PRIu32, hse, hsi_cal, ticks);

	counter = fdt_counter_get(fdt, node, &config);
	assert(counter && config);

	counter->alarm.callback = stm32_hse_over_frequency;
	counter->alarm.ticks = ticks;

	counter_start(counter, config);
	counter_set_alarm(counter);

	return TEE_SUCCESS;
}

driver_init_late(stm32_hse_monitoring);
#endif /* CFG_STM32_HSE_MONITORING */
